docs/theology/gospel.org
#+TITLE: Gospel of Jesus Christ
#+DATE: <2024-06-02>
#+AUTHOR: Shane Mulligan
#+KEYWORDS: faith christianity

#+LATEX_HEADER: \usepackage[margin=0.5in]{geometry}
#+OPTIONS: toc:nil

* Gospel
#+BEGIN_QUOTE
  *John 3:16-21* - For God so loved the world, that he gave his only Son, that whoever (G3956 pas) believes (G4100 pisteuo) in him should not perish but have eternal life. For God did not send his Son into the world to condemn the world, but in order that the world might be saved through him. Whoever believes in him is not condemned, but whoever does not believe is condemned already, because he has not believed in the name of the only Son of God. And this is the judgment: the light has come into the world, and people loved the darkness rather than the light because their deeds were evil. For everyone who does wicked things hates the light and does not come to the light, lest his deeds should be exposed. But _whoever does what is true comes to the light_, so that _it may be clearly seen that his deeds have been carried out in God_. (ESV)
#+END_QUOTE

The gospel involves a believing and obedient heart.

Whoever _does what is true comes to the light._

_Whoever has faith in and puts their trust in in Jesus Christ is not condemned and should not perish._

We must honour Jesus Christ:

#+BEGIN_QUOTE
  *John 5:21-24* - For as the Father raises the dead and gives them life, so also the Son gives life to whom he will. The Father judges no one, but has given all judgment to the Son, that all may honor the Son, just as they honor the Father. _Whoever does not honor the Son does not honor the Father who sent him_. Truly, truly, I say to you, whoever _hears my word and believes (G4100 *pisteuo*) him who sent me has eternal life_. He does not come into judgment, but has passed from death to life.
#+END_QUOTE

I believe =John 5:24= is a true statement and that it should not be read outside of the words Jesus said directly before it (=Whoever does not honor the Son does not honor the Father who sent him=).

We do not nullify the rest of what Jesus has commanded of and asked of us. If Jesus is your judge, then I think it's wise to take on board the rest of what Jesus has said:

#+BEGIN_QUOTE
  *Philippians 1:15-22* - Some indeed preach Christ from envy and rivalry, but others from good will. The latter do it out of love, knowing that I am put here for the defense of the gospel. The former proclaim Christ out of rivalry, not sincerely but thinking to afflict me in my imprisonment. What then? Only that in every way, whether in pretense or in truth, Christ is proclaimed, and in that I rejoice. Yes, and I will rejoice, for I know that through your prayers and the help of the Spirit of Jesus Christ this will turn out for my deliverance, as _it is my eager expectation and hope that I will not be at all ashamed, but that with full courage now as always Christ will be honored in my body, whether by life or by death_. For to me to live is Christ, and to die is gain. _If I am to live in the flesh, that means fruitful labor for me._ Yet which I shall choose I cannot tell.
#+END_QUOTE

We're not justified through the works of the law but through faith, and faith involves obedience to Jesus Christ:

#+BEGIN_QUOTE
  *Galatians 2:15-16* - “We are Jews by nature and not sinners from among the Gentiles; nevertheless knowing that a man is not justified by the works of the Law but through faith in Christ Jesus, even we have believed in Christ Jesus, so that we may be *justified by faith in Christ* and not by the works of the Law; since by the works of the Law no flesh will be justified.
#+END_QUOTE

It's by faith in Christ that we are justified, and faith involves obedience (at least of the heart).

#+BEGIN_QUOTE
  *John 3:36* - Whoever believes (G4100 pisteuo) in the Son has eternal life; whoever does not *obey* the Son shall not see life, but the wrath of God remains on him. (ESV)
#+END_QUOTE

It's faith in the heart which we need; obedience to Jesus Christ and belief in Jesus Christ in the heart, and belief and obedience to God who has _raised from the dead Jesus our Lord, who was delivered up for our trespasses and raised for our justification_.

#+BEGIN_QUOTE
  *John 3:16* - For God so loved the world, that he gave his only Son, that whoever believes (G4100 pisteuo) in him should not perish but have eternal life. (ESV)
#+END_QUOTE

#+BEGIN_SRC text -n :async :results verbatim code :lang text
  :  4100  pisteuo  pist-yoo'-o

   from 4102; to have faith (in, upon, or with respect to, a person or
   thing), i.e. credit; by implication, to entrust (especially one's
   spiritual well-being to Christ):--believe(-r), commit (to trust), put
   in trust with.
   see GREEK for 4102
#+END_SRC

#+BEGIN_SRC text -n :async :results verbatim code :lang text
  :  166  aionios  ahee-o'-nee-os

   from 165; perpetual (also used of past time, or past and future as
   well):--eternal, for ever, everlasting, world (began).
   see GREEK for 165
#+END_SRC

#+BEGIN_SRC text -n :async :results verbatim code :lang text
  :  2222  zoe  dzo-ay'

   from 2198; life (literally or figuratively):--life(-time). Compare
   5590.
   see GREEK for 2198
   see GREEK for 5590
#+END_SRC

#+BEGIN_QUOTE
  *1 John 3:23* - And this is his commandment, that we believe in the name of his Son Jesus Christ and love one another, just as he has commanded us. (ESV)
#+END_QUOTE

#+BEGIN_QUOTE
  *Matthew 22:37-39* - And he said to him, You shall love the Lord your God with all your heart and with all your soul and with all your mind. This is the great and first commandment. And a second is like it: You shall love your neighbor as yourself. (ESV)
#+END_QUOTE

Jesus Christ is the Son of the Living God. Believing on His name is God's will for us, and loving one another is God's will for us as He has commanded. There is more that Jesus has commanded us, too.

The promise to Gentiles:

#+BEGIN_QUOTE
  *Galatians 3:8* - And the Scripture, foreseeing that God would justify the Gentiles by faith, preached the gospel beforehand to Abraham, saying, In you shall all the nations be blessed. (ESV)
#+END_QUOTE

#+BEGIN_QUOTE
  *Genesis 12:3* - I will bless those who bless you, and him who dishonors you I will curse, and in you all the families of the earth shall be blessed. (ESV)
#+END_QUOTE

Because Abraham _obeyed God's voice_:

#+BEGIN_QUOTE
  *Genesis 22:18* - and in your offspring shall all the nations of the earth be blessed, because you have obeyed my voice. (ESV)
#+END_QUOTE

Repentance and coming to the light are absolutely part of the gospel!

#+BEGIN_QUOTE
  *1 Corinthians 15:1-4* -  Now I would remind you, brothers, of the gospel I preached to you, which you received, in which you stand, and by which you are being saved, if you hold fast to the word I preached to you-unless you believed in vain.  For I delivered to you as of first importance what I also received: that Christ died for our sins in accordance with the Scriptures, that he was buried, that he was raised on the third day in accordance with the Scriptures,  (ESV)
#+END_QUOTE

#+BEGIN_QUOTE
  *Acts 2:47* - Praising God, and having favour with all the people. And the Lord added to the church daily such as should be saved. (ESV)
#+END_QUOTE

** I believe that I should try as hard as I can to enter via the narrow gate
