docs/theology/gospel.tex
\subsubsection{Narrow is the gate and hard is the lway that leads to life}
\label{sec:orgea486a6}
\textbf{*Matthew 7:13} - Enter by the narrow gate. For the gate is wide and the way is easy that leads to destruction, and those who enter by it are many.

\textbf{*Matthew 7:14} - For the gate is narrow and the way is hard that leads to life, and those who find it are few.

\textbf{*Luke 13:24} - Strive to enter through the narrow door. For many, I tell you, will seek to enter and will not be able.

\subsubsection{Obedience}
\label{sec:orga709f6e}
\textbf{*Ezekiel 33:31} - And they come to you as people come, and they sit before you as my people, and \uline{they hear what you say but they will not do it}; for with lustful talk in their mouths they act; their heart is set on their gain. (ESV)

\subsubsection{The way is easy that leads to destruction}
\label{sec:orgf9c73de}
\textbf{*Matthew 7:13} - Enter by the narrow gate. For the gate is wide and the way is easy that leads to destruction, and those who enter by it are many.

\subsubsection{Narrow gate}
\label{sec:orgc41dadd}
\textbf{*II Peter 1:10} - Therefore, brothers, be all the more diligent to make your calling and election sure, for if you practice these qualities you will never fall. (ESV)

\textbf{*Hebrews 4:11} - Let us therefore strive to enter that rest, so that no one may fall by the same sort of disobedience. (ESV)

\textbf{*I Corinthians 9:24-27} - Do you not know that in a race all the runners compete, but only one receives the prize? So run that you may obtain it. Every athlete exercises self-control in all things. They do it to receive a perishable wreath, but we an imperishable. So I do not run aimlessly; I do not box as one beating the air. But I discipline my body and keep it under control, lest after preaching to others I myself should be disqualified. (ESV)

\textbf{*Philippians 2:12-13} - Therefore, my beloved, as you have always obeyed, so now, not only as in my presence but much more in my absence, work out your own salvation with fear and trembling, for it is God who works in you, both to will and to work for his good pleasure. (ESV)

\subsubsection{Submit to God's righteousness}
\label{sec:orgd029928}
\textbf{Romans 10:3} - For, being ignorant of the righteousness that comes from God, and seeking to establish their own, they did not submit to God's righteousness. (ESV)

\subsubsection{We must do the will of God, which is the food and drink which Jesus gives us}
\label{sec:org1b2c951}
\textbf{*John 6:27} - Do not labor for the food that perishes, but for the food that endures to eternal life, which the Son of Man will give to you. For on him God the Father has set his seal. (ESV)

\textbf{*John 7:34-39} - You will seek me and you will not find me. Where I am you cannot come. (ESV) The Jews said to one another, Where does this man intend to go that we will not find him? Does he intend to go to the Dispersion among the Greeks and teach the Greeks?  What does he mean by saying, You will seek me and you will not find me, and, Where I am you cannot come?  On the last day of the feast, the great day, Jesus stood up and cried out, If anyone thirsts, let him come to me and drink.  Whoever believes in me, as the Scripture has said, Out of his heart will flow rivers of living water.  Now this he said about the Spirit, whom those who believed in him were to receive, for as yet the Spirit had not been given, because Jesus was not yet glorified.

\subsection{A life of faith (living in accordance with the truth, and in relationship with God) is required - faith continues}
\label{sec:org94f7a6b}
What I mean by relationship is:
\begin{itemize}
\item being obedient to God,
\begin{itemize}
\item abiding in Jesus
\end{itemize}
\item being accountable to God,
\item waiting on God,
\item trusting on God,
\item being led by the Spirit of God,
\item etc.
\end{itemize}

\subsubsection{We must abide by his teaching}
\label{sec:org824e01d}

\begin{quote}
\textbf{II John 1:9} - Everyone who goes on ahead and does not abide in the teaching of Christ, does not have God. Whoever abides in the teaching has both the Father and the Son.
\end{quote}

It is a gift to be obedient to Jesus:

\begin{quote}
\textbf{Romans 6:23} - For the wages of sin is death, but the free gift of God is eternal life \uline{in} Christ Jesus our Lord. (ESV)
\end{quote}

\subsubsection{We must live sowing to the Spirit}
\label{sec:orgbaf16f5}

\begin{quote}
\textbf{Galatians 6:7-8} - Do not be deceived: God is not mocked, for whatever one sows, that will he also reap. For the one who sows to his own flesh will from the flesh reap corruption, but the one who sows to the Spirit will from the Spirit reap eternal life. (ESV)
\end{quote}

\subsubsection{We must be servants of Christ}
\label{sec:org5987dd5}

\begin{quote}
\textbf{Ephesians 6:6} - not by the way of eye-service, as people-pleasers, but as servants of Christ, doing the will of God from the heart,
\end{quote}

\subsubsection{We must remain faithful to Jesus Christ}
\label{sec:org59cf867}

\begin{quote}
\textbf{Jude 1:4} - For certain persons have crept in unnoticed, those who were long beforehand marked out for this condemnation, ungodly persons who turn the grace of our God into licentiousness and deny our only Master and Lord, Jesus Christ. (NASB)
\end{quote}

\begin{quote}
\textbf{Colossians 2:18-19} - Let no one disqualify you, insisting on asceticism and worship of angels, going on in detail about visions, puffed up without reason by his sensuous mind, and not holding fast to the Head, from whom the whole body, nourished and knit together through its joints and ligaments, grows with a growth that is from God.
\end{quote}

\subsubsection{We should clean ourselves with the aid of the Word and the Holy Spirit}
\label{sec:orga2a0dc4}
We should clean ourselves up:

\begin{quote}
\textbf{II Timothy 2:21} - Therefore, if anyone cleanses himself from what is dishonorable, he will be a vessel for honorable use, set apart as holy, useful to the master of the house, ready for every good work.
\end{quote}

Through faith, the Holy Spirit cleanses us:

\begin{quote}
\textbf{Acts 15:8-9} - And God, who knows the heart, bore witness to them, by giving them the Holy Spirit just as he did to us, and he made no distinction between us and them, having cleansed their hearts by faith.
\end{quote}

By obedience to the word of God:

\begin{quote}
\textbf{Ephesians 5:25-27} - Husbands, love your wives, as Christ loved the church and gave himself up for her, that he might sanctify her, having cleansed her by the washing of water with the word, so that he might present the church to himself in splendor, without spot or wrinkle or any such thing, that she might be holy and without blemish.
\end{quote}

By the Holy Spirit washing and renewing us:

\begin{quote}
\textbf{Titus 3:4-6}- But when the goodness and loving kindness of God our Savior appeared, he saved us, not because of works done by us in righteousness, but according to his own mercy, by the washing of regeneration and renewal of the Holy Spirit, whom he poured out on us richly through Jesus Christ our Savior,
\end{quote}

It's the will of God:

\begin{quote}
\textbf{I Thessalonians 4:3} - For this is the will of God, your sanctification: that you abstain from sexual immorality;
\end{quote}

\subsubsection{We \textbf{must} clean ourselves up with God's help}
\label{sec:org2be78bd}

\begin{quote}
\textbf{Daniel 12:9-10} - He said, Go your way, Daniel, for the words are shut up and sealed until the time of the end.  Many shall purify themselves and make themselves white and be refined, but the wicked shall act wickedly. And none of the wicked shall understand, but those who are wise shall understand.
\end{quote}

\begin{quote}
\textbf{Revelation of John 21:27} - But nothing unclean will ever enter it, nor anyone who does what is detestable or false, but only those who are written in the Lamb's book of life.
\end{quote}

\begin{quote}
\textbf{Revelation of John 22:14} - Blessed are those who wash their robes, so that they may have the right to the tree of life and that they may enter the city by the gates. (ESV)
\end{quote}
