docs/theology/gospel.org
*** We must stop sinning

#+BEGIN_QUOTE
  *II Peter 2:2-4* - And many will follow their sensuality, and because of them _the way of truth_ will be blasphemed. And in their greed they will exploit you with false words. Their condemnation from long ago is not idle, and their destruction is not asleep. For if God did not spare angels when they sinned, but cast them into hell and committed them to chains of gloomy darkness to be kept until the judgment;
#+END_QUOTE

#+BEGIN_QUOTE
  *II Peter 2:19-20* - They promise them freedom, but they themselves are slaves of corruption. For _whatever overcomes a person, to that he is enslaved_. For if, after they have escaped the defilements of the world through the knowledge of our Lord and Savior Jesus Christ, they are again entangled in them and overcome, the last state has become worse for them than the first.
#+END_QUOTE

Therefore, the way of truth involves following Jesus and putting a stop to sin.

I agree with Billy Graham:
- https://www.youtube.com/watch?v=jCrhHjQgVhA

#+BEGIN_QUOTE
  *Revelation of John 21:8* - But as for the cowardly, the faithless, the detestable, as for murderers, the sexually immoral, sorcerers, idolaters, and all liars, their portion will be in the lake that burns with fire and sulfur, which is the second death." (ESV)
#+END_QUOTE

*** We should put the ignorant to silence through doing good

#+BEGIN_QUOTE
  *I Peter 2:15* - For this is the will of God, that by doing good you should put to silence the ignorance of foolish people.
#+END_QUOTE

Jesus says you must obey God to be part of His family:

#+BEGIN_QUOTE
  *Luke 8:21* - But He answered and said to them, “My mother and My brothers are these who hear the word of God and do it.”
#+END_QUOTE

Jesus implies you must obey Him (Jesus) to be part of His family:

#+BEGIN_QUOTE
  *John 7:16* - So Jesus answered them, My teaching is not mine, but his who sent me.
#+END_QUOTE

** The obedient children are the ones who are not conformed to the passions of our former ignorance
#+BEGIN_QUOTE
  *I Peter 1:14-16* - As obedient children, do not be conformed to the passions of your former ignorance, but as he who called you is holy, you also be holy in all your conduct, since it is written, You shall be holy, for I am holy.
#+END_QUOTE

** The sons of disobedience are the ones who are conformed to sexual immorality, impurity, or covetousness, etc.
#+BEGIN_QUOTE
  *Ephesians 5:5-7* - For you may be sure of this, that everyone who is sexually immoral or impure, or who is covetous (that is, an idolater), has no inheritance in the kingdom of Christ and God. Let no one deceive you with empty words, for because of these things the wrath of God comes upon the sons of disobedience. Therefore do not associate with them;
#+END_QUOTE

** Get to know Jesus by following His commandments
#+BEGIN_QUOTE
  *Matthew 7:21-27* - Not everyone who says to me, Lord, Lord, will enter the kingdom of heaven, but the one who does the will of my Father who is in heaven.  On that day many will say to me, Lord, Lord, did we not prophesy in your name, and cast out demons in your name, and do many mighty works in your name?  And then will I declare to them, I never knew you; depart from me, you workers of lawlessness.  Everyone then who hears these words of mine and does them will be like a wise man who built his house on the rock.  And the rain fell, and the floods came, and the winds blew and beat on that house, but it did not fall, because it had been founded on the rock.  And everyone who hears these words of mine and does not do them will be like a foolish man who built his house on the sand.  And the rain fell, and the floods came, and the winds blew and beat against that house, and it fell, and great was the fall of it. (ESV)
#+END_QUOTE

#+BEGIN_QUOTE
  *Luke 6:46-49* - Why do you call me Lord, Lord, and not do what I tell you? Everyone who comes to me and hears my words and does them, I will show you what he is like: he is like a man building a house, who dug deep and laid the foundation on the rock. And when a flood arose, the stream broke against that house and could not shake it, because it had been well built. But the one who hears and does not do them is like a man who built a house on the ground without a foundation. When the stream broke against it, immediately it fell, and the ruin of that house was great. (ESV)
#+END_QUOTE

#+BEGIN_QUOTE
  *I John 2:4* - Whoever says I know him but does not keep his commandments is a liar, and the truth is not in him,
#+END_QUOTE

#+BEGIN_QUOTE
  *Matthew 7:21-27* - Not everyone who says to me, Lord, Lord, will enter the kingdom of heaven, but the one who does the will of my Father who is in heaven.  On that day many will say to me, Lord, Lord, did we not prophesy in your name, and cast out demons in your name, and do many mighty works in your name?  And then will I declare to them, I never knew you; depart from me, you workers of lawlessness.  Everyone then who hears these words of mine and does them will be like a wise man who built his house on the rock.  And the rain fell, and the floods came, and the winds blew and beat on that house, but it did not fall, because it had been founded on the rock.  And everyone who hears these words of mine and does not do them will be like a foolish man who built his house on the sand.  And the rain fell, and the floods came, and the winds blew and beat against that house, and it fell, and great was the fall of it. (ESV)
#+END_QUOTE

You must obey Jesus:

#+BEGIN_QUOTE
  *John 3:36* - Whoever believes (G4100 *pisteuo*) in the Son has eternal life; whoever does not *obey* the Son shall not see life, but the wrath of God remains on him. (ESV)
#+END_QUOTE

We must obey God. We have faith in God who was delivered up for our trespasses and raised for our justification, and having faith in God is having faith in His Son which is believing in and obeying Jesus Christ:

#+BEGIN_QUOTE
  *Romans 4:23-25* - But the words it was counted to him were not written for his sake alone, but for ours also. It will be counted to us who believe (G4100 *pisteuo*) in him who raised from the dead Jesus our Lord, who was delivered up for our trespasses and raised for our justification. (ESV)
#+END_QUOTE

** Atonement
Jesus' sacrifice is the only atonement for our sin we need. It's comprehensive.
It must be received through faith in Jesus Christ.

#+BEGIN_QUOTE
  - *Romans 3:25* -  whom God put forward as a propitiation by his blood, to be received by faith.  This was to show God's righteousness, because in his divine forbearance he had passed over former sins.  (ESV)
#+END_QUOTE

#+BEGIN_QUOTE
  - *Colossians 2:14* - by canceling the record of debt that stood against us with its legal demands. This he set aside, nailing it to the cross.
#+END_QUOTE

#+BEGIN_QUOTE
  - *Philippians 1:9-11* - And it is my prayer that your love may abound more and more, with knowledge and all discernment, so that you may approve what is excellent, and so be pure and blameless for the day of Christ, filled with the fruit of righteousness that comes through Jesus Christ, to the glory and praise of God.
#+END_QUOTE

We receive reconciliation through Jesus Christ who is our Lord.

#+BEGIN_QUOTE
  *Romans 5:11* - More than that, we also rejoice in God through our Lord Jesus Christ, through whom we have now received reconciliation. (ESV)
#+END_QUOTE

#+BEGIN_QUOTE
  *Romans 5:19* - For as by the one man's disobedience the many were made sinners, so by the one man's obedience the many will be made righteous. (ESV)
#+END_QUOTE

