docs/theology/gospel.org
** Whoever makes an appeal to God, calls upon His name will be saved
#+BEGIN_SRC text -n :async :results verbatim code :lang text
  :  1941  epikaleomai  ep-ee-kal-eh'-om-ahee

   middle voice from 1909 and 2564; to entitle; by implication, to invoke
   (for aid, worship, testimony, decision, etc.):--appeal (unto), call
   (on, upon), surname.
   see GREEK for 1909
   see GREEK for 2564
#+END_SRC

Confessing that Jesus is Lord is becoming obedient to Him:

#+BEGIN_QUOTE
  *Romans 10:8-9* - But what does it say? “The word is near you, in your mouth and in your heart”-- that is, the word (G4487 rhema) of faith (G4102 pistis) which we are preaching, that if you confess (G3670 homologeo) with your mouth Jesus as Lord, and _believe (G4100 *pisteuo*) in your heart_ (G2588 kardia) that God raised Him from the dead, you will be saved; (NASB)
#+END_QUOTE

It's faith in the heart that a person needs.

#+BEGIN_QUOTE
  *John 7:17* -  If anyone's will is to do God's will, he will know whether the teaching is from God or whether I am speaking on my own authority.  (ESV)
#+END_QUOTE

Therefore, to arrive at the knowledge of the truth, you've got to have an obedient heart.

How can they call on Him whom they have not had faith in?

How will they have faith in Him whom they have not heard?

How will they hear without a preacher?

#+BEGIN_QUOTE
  *Romans 10:14-15*- But how are they to call on him in whom they have not believed? And how are they to believe in him of whom they have never heard? And how are they to hear without someone preaching? And how are they to preach unless they are sent? As it is written, How beautiful are the feet of those who preach the good news!
#+END_QUOTE

Confess:

#+BEGIN_SRC text -n :async :results verbatim code :lang text
  :  3670  homologeo  hom-ol-og-eh'-o

   from a compound of the base of 3674 and 3056; to assent, i.e.
   covenant, acknowledge:--con- (pro-)fess, confession is made, give
   thanks, promise.
   see GREEK for 3674
   see GREEK for 3056
#+END_SRC

*** Baptism is an appeal
Baptism is an appeal to God for a good conscience - It's an *appeal* to God but not strictly required to be saved.
It is an appeal to God for a good conscience, through the resurrection of Jesus Christ.
I definitely believe that "believer's baptism" is the right way to perform baptism.
Baptism does save.

#+BEGIN_QUOTE
  *I Peter 3:18-21* - For Christ also suffered once for sins, the righteous for the unrighteous, that he might bring us to God, being put to *death in the flesh but made alive in the spirit*, in which he went and proclaimed to the spirits in prison, because *they formerly did not obey*, when God's patience waited in the days of Noah, while the ark was being prepared, in which a few, that is, eight persons, were brought safely through water. Baptism, which corresponds to this, now saves you, not as a removal of dirt from the body but as an appeal to God for a good conscience, through the resurrection of Jesus Christ,
#+END_QUOTE
